testCases/03_DEM/02_particle_wall_collision/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Web:      www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ("glitter");

interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     0.01;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain -1;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default


outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel false;
    parallelDEM false;
}

DEM
{
    LcCoeff 4.0;
	rotationModel mindlin1953;
    materials
    {
        particle
        {
            Y       5e7;
            nu      0;
            // mu      0;
            mu      0.1;
            // mu      1;
            adhN    0;
            // eps     1;
            eps     0.6;
        }

        wall
        {
            Y       1e7;
            nu      0;
            // mu      0;
            mu      0.1;
            // mu      1;
            adhN    0;
            eps     0.5;
        }
    }

    collisionPatches
    {
		bottom
		{
			material wall;
			nVec (0.0 -1 0.0);
			planePoint (0 -0.03 0);
		}
    }
}

virtualMesh
{
    level 3;
    charCellSize 0.001;
}


glitter
{
    fullyCoupledBody;

    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;
    
    // updateTorque false;
    updateTorque true;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    
    // bodyAddition
    // {
    //     addModel once;
    //     onceCoeffs{}
    // }

    bodyAddition
    {
        addModel repeatRandomPosition;
        repeatRandomPositionCoeffs
        {
            addMode fieldBased;
 			fieldBasedCoeffs
 			{
 				fieldName lambda;
 				fieldValue 0.1;
 			}
            addDomain boundBox;
 			boundBoxCoeffs
 			{
 				minBound (-0.03 -0.03 -0.01);
 				maxBound (0.03 -0.02 0.01);
 			}
            //~ scalingMode    noScaling;
 			//~ noScalingCoeffs{}
            scalingMode    randomScaling;
            randomScalingCoeffs
            {
                minScale 0.5;
                maxScale 0.5;
            }
            rotationMode   randomRotation;
 			randomRotationCoeffs{}
        }
    }
    material particle;
}

// ************************************************************************* //
